Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
             - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::438465168484:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250619023048449900000002/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-06-19T03:44:47.000+0000" -> (known after apply)
      + source_code_hash               = "da3cjDo7DXui98TWUDSWj0dAT0krBQSERrtByZ0GfII="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250619023048449900000002"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CLINIC_TEMP_BUCKET_NAMES"             = "pgxflow-backend-20250619023038383000000003"
              - "COGNITO_ADMIN_GROUP_NAME"             = "administrators"
              - "COGNITO_MANAGER_GROUP_NAME"           = "managers"
              - "COHORT_MAKER_LAMBDA"                  = "sbeacon-backend-generateCohortVCfs"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DPORTAL_BUCKET"                       = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_CLINICAL_ANNOTATIONS_TABLE"    = "sbeacon-dataportal-clinical-annotations"
              - "DYNAMO_CLINICAL_VARIANTS_TABLE"       = "sbeacon-dataportal-clinical-variants"
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PRICING_CACHE_TABLE"           = "sbeacon-dataportal-pricing-cache"
              - "DYNAMO_PROJECTS_TABLE"                = "sbeacon-dataportal-projects"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "DYNAMO_SAVED_QUERIES_TABLE"           = "sbeacon-dataportal-saved-queries"
              - "HUB_NAME"                             = "RSJPD"
              - "INDEXER_LAMBDA"                       = "sbeacon-backend-indexer"
              - "JUPYTER_INSTACE_ROLE_ARN"             = "arn:aws:iam::438465168484:role/sbeacon_backend_sagemaker_jupyter_instance_role"
              - "JUPYTER_LIFECYCLE_CONFIG_NAME"        = "clone-gaspi-notebooks"
              - "REPORTS_LAMBDA"                       = "sbeacon-backend-generateReports"
              - "SUBMIT_LAMBDA"                        = "sbeacon-backend-submitDataset"
              - "USER_POOL_ID"                         = "ap-southeast-3_wrRXa0JGY"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "LM8xE7Puu1XGRG5kdqwmX5OnXGKq7DHqVAdeYRQTHvw="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-0"
        name        = "sbeacon-backend-generateCohortVCfs-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "RWsoBWnb3wSEXYMcmEuxnT9a3NuBt7ZNB/f5GViNHnw="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250619023048449900000002"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "COGNITO_USER_POOL_ID"                 = "ap-southeast-3_wrRXa0JGY"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DPORTAL_BUCKET"                       = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-06-19T02:32:34.820+0000" -> (known after apply)
      + source_code_hash               = "PdbpzgHEgkUYCWxfGy2Ml10Hv/TPMKmAJ616pjQI86Q="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ last_modified                  = "2025-06-19T03:44:52.000+0000" -> (known after apply)
      + source_code_hash               = "q6YqNm+FGZh0mC73pnVxfCp5+2d8ob9WySE2ZNTsk7o="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ last_modified                  = "2025-06-19T03:44:52.000+0000" -> (known after apply)
      + source_code_hash               = "5kliUNJZbqBOUCgKL66B0dVdQiuXudO5phBElX2tM8o="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "LFJqGgUxkpI+d5BPvp4ZFMBcAdw3mULAJnsszzL8AkA="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-06-19T03:44:53.000+0000" -> (known after apply)
      + source_code_hash               = "uWBtECckr4VgONWwRSMahvwlJkVMXupOuAsMVflcw68="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "7vU1fYNJDymOKc9LzW0EcIHbjaDNfrm7FZulxuhxgqg="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "LPq8j72KT7ylRJGF62E8EFVcjuD2zrK03EC4hOjXraU="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ last_modified                  = "2025-06-19T03:44:52.000+0000" -> (known after apply)
      + source_code_hash               = "W42m5mkGN/wYMMWv6rwSRDTmCOxOLSH/ljrUeRNJMoE="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ last_modified                  = "2025-06-19T03:44:52.000+0000" -> (known after apply)
      + source_code_hash               = "/MG6vtn4eVHzPbL8cnVBjrbvzfJ94ysES0Zgo7gpcAI="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ last_modified                  = "2025-06-19T03:44:47.000+0000" -> (known after apply)
      + source_code_hash               = "NtpDosMXU5IYl+u2YOMQRPsaPtqAaoTifcBQcKmLMHI="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "wXkz4w80llpBK29lbeKzLRkG5Ubt2A4vKKf3sM/K0s4="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ last_modified                  = "2025-06-19T03:44:47.000+0000" -> (known after apply)
      + source_code_hash               = "WVVOloez7gkeQI08DVvz+DdWl6muHXU66Ybdx0XWpQs="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ last_modified                  = "2025-06-19T03:44:54.000+0000" -> (known after apply)
      + source_code_hash               = "mLo+I3DiifqhB30ceQQVtUIhWmmLabYCGVS/Gll12bM="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "iFV+2TMyjsFB/VSTCbQaiyLLR2/7jdJxLsyBfM//D68="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "nQY9mquZpIDTEQVl3dPv9jd3fUG7HZYCFqpA/KZpXFM="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ last_modified                  = "2025-06-19T03:44:47.000+0000" -> (known after apply)
      + source_code_hash               = "YzbIY3kucaUg2xAUBN9gFjQaaX4KEx6a9HqGZVtEw/I="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ last_modified                  = "2025-06-19T03:44:41.000+0000" -> (known after apply)
      + source_code_hash               = "gph+X2JxPfq0KZwNqqEZDlp0a0iVEh5VDvUGHOBLDes="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "security-sendSecurityAlert"
      ~ last_modified                  = "2025-06-19T02:31:44.228+0000" -> (known after apply)
      + source_code_hash               = "KxNfZMwV0/aL2sywKp8v94AygysI2wfu+/0tXWvRVAk="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "security-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ last_modified                  = "2025-06-19T02:37:51.895+0000" -> (known after apply)
      + source_code_hash               = "U4lbfmxk3Gx8xPeaV5k7g9S0bYDVtOvecnKi+2XYpbg="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-getResultsURL"
      ~ last_modified                  = "2025-06-19T02:32:59.676+0000" -> (known after apply)
      + source_code_hash               = "dVSEgrmq1DFfOCnaZ+zMliQRc1f39f2VZ2G4YKuSENE="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ last_modified                  = "2025-06-19T02:37:29.469+0000" -> (known after apply)
      + source_code_hash               = "YPOUbU79SbcnXZAFpwDUyRr38uQb7MX5unImrOSw0A0="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-initLookup"
      ~ last_modified                  = "2025-06-19T02:37:58.457+0000" -> (known after apply)
      + source_code_hash               = "E1M8f6hftjGhsIaX0dKlRu3YbiTZqQXiRvsFn+JDyIs="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-06-19T02:37:40.747+0000" -> (known after apply)
      + source_code_hash               = "KdjDXZpZUHlFNs02GVQyjuPyUD+D9PVPVdx3ZDa83UE="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-0"
        name        = "pgxflow-backend-lookup-sendJobEmail-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-sendJobEmail"
      ~ last_modified                  = "2025-06-19T02:33:08.555+0000" -> (known after apply)
      + source_code_hash               = "+r3BcsdWPz1FFDQkuqn/tZ7JDqvFzjxEJotXoLT2wsc="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_wrRXa0JGY"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ last_modified                  = "2025-06-19T02:32:48.351+0000" -> (known after apply)
      + source_code_hash               = "8qdN67TNydBkrhGSWXzsDIGB5+i5SiVVK3/YMl/PcaA="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-getResultsURL"
      ~ last_modified                  = "2025-06-19T02:32:42.665+0000" -> (known after apply)
      + source_code_hash               = "JZsNmAKBg/dZY9nXN9In6ZyEbWhJ70uMNz0ukLmVWFQ="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ last_modified                  = "2025-06-19T02:37:35.135+0000" -> (known after apply)
      + source_code_hash               = "aqJNL48WNdhhpycwKJhUk49nqLePk8U6m/cnny7EkdY="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-initPharmcat"
      ~ last_modified                  = "2025-06-19T02:40:41.308+0000" -> (known after apply)
      + source_code_hash               = "Ubl+JvYUK3g1Vn9ObmDJQNo9eM0aO6rJizy2ZoOh2fE="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-postprocessor"
      ~ last_modified                  = "2025-06-19T03:44:32.000+0000" -> (known after apply)
      + source_code_hash               = "XkhcbBF+QBstc4u6wAQ2/1KHw/y/RfNXbyQ2DuNuFHg="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-pharmcat-sendJobEmail:pgxflow-backend-pharmcat-sendJobEmail-0"
        name        = "pgxflow-backend-pharmcat-sendJobEmail-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_wrRXa0JGY"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-sendJobEmail"
      ~ last_modified                  = "2025-06-19T02:33:14.134+0000" -> (known after apply)
      + source_code_hash               = "q+z0Lz/xK5uFvayPmHfMqxZpSpAVXhQkKIAT3m3eL+E="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_wrRXa0JGY"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ last_modified                  = "2025-06-19T02:32:54.067+0000" -> (known after apply)
      + source_code_hash               = "mR1LwyBnYEJQBWal4q2+usY30q9C1iqfXgNKLgp3OnA="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 10 to add, 53 to change, 5 to destroy.

Changes to Outputs:
  ~ admin_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_wrRXa0JGY --region ap-southeast-3 --client-id 7r8ksm03nbn0hf8ar7p86416ad --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=Admin@Example123! --output json --query AuthenticationResult.IdToken" -> (known after apply)
  ~ cognito_client_id    = "7r8ksm03nbn0hf8ar7p86416ad" -> (known after apply)
  ~ cognito_user_pool_id = "ap-southeast-3_wrRXa0JGY" -> (known after apply)
  ~ guest_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_wrRXa0JGY --region ap-southeast-3 --client-id 7r8ksm03nbn0hf8ar7p86416ad --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest@Example123! --output json --query AuthenticationResult.IdToken" -> (known after apply)
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=2598827130174904583]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.webgui.null_resource.s3-upload: Destroying... [id=4043815742362835550]
module.webgui.null_resource.s3-upload: Destruction complete after 0s
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-pharmcat-updateReferenceFiles]
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-lookup-updateReferenceFiles]
module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0]: Modifying... [id=security-sendSecurityAlert]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-pharmcat-getResultsURL]
module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-lookup-getResultsURL]
module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-deidentifyFiles]
module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-getInfo]
module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-generateReports]
module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-getProjects]
module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-getFilteringTerms]
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0]: Modifications complete after 6s [id=pgxflow-backend-lookup-updateReferenceFiles]
module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-updateFiles]
module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0]: Modifications complete after 6s [id=security-sendSecurityAlert]
module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-getEntryTypes]
module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0]: Modifications complete after 6s [id=sbeacon-backend-deidentifyFiles]
module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-getConfiguration]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-pharmcat-updateReferenceFiles, 10s elapsed]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-pharmcat-getResultsURL, 10s elapsed]
module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-lookup-getResultsURL, 10s elapsed]
module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getInfo, 10s elapsed]
module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-generateReports, 10s elapsed]
module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getProjects, 10s elapsed]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0]: Modifications complete after 11s [id=pgxflow-backend-pharmcat-updateReferenceFiles]
module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-getMap]
module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0]: Modifications complete after 11s [id=sbeacon-backend-getInfo]
module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-indexer]
module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getFilteringTerms, 10s elapsed]
module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-updateFiles, 10s elapsed]
module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getEntryTypes, 10s elapsed]
module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getConfiguration, 10s elapsed]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_lambda_function.this[0]: Modifications complete after 17s [id=pgxflow-backend-pharmcat-getResultsURL]
module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-performQuery]
module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0]: Modifications complete after 16s [id=sbeacon-backend-getProjects]
module.cognito.aws_lambda_permission.customMessageLambdaTrigger: Destroying... [id=SBeaconBackendAllowCustomMessageLambdaTriggerInvoke]
module.cognito.aws_lambda_permission.customMessageLambdaTrigger: Destruction complete after 0s
module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0]: Modifying... [id=cognito-customMessageLambdaTrigger]
module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-lookup-getResultsURL, 20s elapsed]
module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-generateReports, 20s elapsed]
module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getMap, 10s elapsed]
module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-indexer, 10s elapsed]
module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getFilteringTerms, 20s elapsed]
module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_lambda_function.this[0]: Modifications complete after 22s [id=pgxflow-backend-lookup-getResultsURL]
module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0]: Modifications complete after 6s [id=cognito-customMessageLambdaTrigger]
module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0]: Modifying... [id=cognito-logEmailDelivery]
module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0]: Modifying... [id=cognito-sendClinicJobEmail]
module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0]: Modifications complete after 24s [id=sbeacon-backend-generateReports]
module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0]: Modifying... [id=cognito-sendRegistrationEmail]
module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-updateFiles, 20s elapsed]
module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getEntryTypes, 20s elapsed]
module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getConfiguration, 20s elapsed]
module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-performQuery, 10s elapsed]
module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0]: Modifications complete after 5s [id=cognito-logEmailDelivery]
module.cognito.aws_cognito_user_pool.gaspi_user_pool: Creating...
module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0]: Modifications complete after 29s [id=sbeacon-backend-getFilteringTerms]
module.cognito.aws_cognito_user_pool.gaspi_user_pool: Creation complete after 2s [id=ap-southeast-3_6zYbxTjuA]
module.cognito.aws_lambda_permission.customMessageLambdaTrigger: Creating...
module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client: Creating...
module.cognito.aws_lambda_permission.customMessageLambdaTrigger: Creation complete after 0s [id=SBeaconBackendAllowCustomMessageLambdaTriggerInvoke]
module.cognito.aws_cognito_user.admin: Creating...
module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client: Creation complete after 0s [id=4np4n3rvt771kj3ocg18gr2t3v]
module.cognito.aws_cognito_user.guest: Creating...
module.cognito.aws_cognito_user.admin: Creation complete after 1s [id=ap-southeast-3_6zYbxTjuA/admin@example.com]
module.cognito.aws_cognito_user.guest: Creation complete after 1s [id=ap-southeast-3_6zYbxTjuA/guest@example.com]
module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getMap, 20s elapsed]
module.cognito.aws_cognito_identity_pool.gaspi_identity_pool: Modifying... [id=ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7]
module.pgxflow[0].aws_api_gateway_authorizer.pgxflow_user_pool_authorizer: Modifying... [id=1h2hn3]
module.cognito.aws_cognito_identity_pool.gaspi_identity_pool: Modifications complete after 0s [id=ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7]
module.sbeacon.data.aws_iam_policy_document.lambda-generateCohortVCfs: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-generateCohortVCfs: Read complete after 0s [id=331692227]
module.sbeacon.aws_api_gateway_authorizer.beacon_user_pool_authorizer: Modifying... [id=25479y]
module.pgxflow[0].aws_api_gateway_authorizer.pgxflow_user_pool_authorizer: Modifications complete after 0s [id=1h2hn3]
module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-qcFigures]
module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-indexer, 20s elapsed]
module.sbeacon.aws_api_gateway_authorizer.beacon_user_pool_authorizer: Modifications complete after 0s [id=25479y]
module.cognito.data.aws_iam_policy_document.gaspi_authenticated: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_authenticated: Read complete after 0s [id=1390963884]
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated: Read complete after 0s [id=3158051254]
module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy: Reading...
module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy: Read complete after 0s [id=1390963884]
module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy: Reading...
module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy: Read complete after 0s [id=1390963884]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[0]: Modifying... [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-0]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[0]: Modifications complete after 2s [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-0]
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-generateCohortVCfs]
module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0]: Still modifying... [id=cognito-sendClinicJobEmail, 10s elapsed]
module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0]: Modifications complete after 11s [id=cognito-sendClinicJobEmail]
module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles: Modifying... [id=ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7]
module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles: Modifications complete after 0s [id=ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7]
module.cognito.aws_cognito_user_group.admin_group: Creating...
module.cognito.aws_cognito_user_group.admin_group: Creation complete after 0s [id=ap-southeast-3_6zYbxTjuA/administrators]
module.cognito.aws_cognito_user_group.manager_group: Creating...
module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0]: Still modifying... [id=cognito-sendRegistrationEmail, 10s elapsed]
module.cognito.aws_cognito_user_group.manager_group: Creation complete after 0s [id=ap-southeast-3_6zYbxTjuA/managers]
module.cognito.aws_cognito_user_in_group.admin_in_admin_group: Creating...
module.cognito.aws_cognito_user_in_group.admin_in_admin_group: Creation complete after 1s [id=ap-southeast-3_6zYbxTjuA,administrators,admin@example.com]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-sendJobEmail: Reading...
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-sendJobEmail: Read complete after 0s [id=4162770914]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-sendJobEmail: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-sendJobEmail: Read complete after 0s [id=4162770914]
module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0]: Modifying... [id=pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-0]
module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0]: Modifications complete after 29s [id=sbeacon-backend-updateFiles]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0]: Modifying... [id=pgxflow-backend-pharmcat-sendJobEmail:pgxflow-backend-pharmcat-sendJobEmail-0]
module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getEntryTypes, 30s elapsed]
module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getConfiguration, 30s elapsed]
module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0]: Modifications complete after 1s [id=pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-lookup-sendJobEmail]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0]: Modifications complete after 1s [id=pgxflow-backend-pharmcat-sendJobEmail:pgxflow-backend-pharmcat-sendJobEmail-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-pharmcat-sendJobEmail]
module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-performQuery, 20s elapsed]
module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0]: Modifications complete after 6s [id=pgxflow-backend-qcFigures]
module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0]: Modifications complete after 15s [id=cognito-sendRegistrationEmail]
module.sbeacon.data.aws_iam_policy_document.admin-lambda-access: Reading...
module.sbeacon.data.aws_iam_policy_document.admin-lambda-access: Read complete after 0s [id=278189107]
module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0]: Modifying... [id=sbeacon-backend-admin:sbeacon-backend-admin-0]
module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0]: Modifications complete after 1s [id=sbeacon-backend-admin:sbeacon-backend-admin-0]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-admin]
module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0]: Modifications complete after 34s [id=sbeacon-backend-getEntryTypes]
module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getMap, 30s elapsed]
module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-indexer, 30s elapsed]
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-generateCohortVCfs, 10s elapsed]
module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0]: Modifications complete after 40s [id=sbeacon-backend-getConfiguration]
module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-lookup-sendJobEmail, 10s elapsed]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-pharmcat-sendJobEmail, 10s elapsed]
module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-performQuery, 30s elapsed]
module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0]: Modifications complete after 11s [id=pgxflow-backend-lookup-sendJobEmail]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-gnomad]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-admin, 10s elapsed]
module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-getMap, 40s elapsed]
module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-indexer, 40s elapsed]
module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0]: Modifications complete after 40s [id=sbeacon-backend-getMap]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_lambda_function.this[0]: Modifications complete after 16s [id=pgxflow-backend-pharmcat-sendJobEmail]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-pharmcat-gnomad]
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-generateCohortVCfs, 20s elapsed]
module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-performQuery, 40s elapsed]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-gnomad, 10s elapsed]
module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0]: Modifications complete after 46s [id=sbeacon-backend-indexer]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0]: Modifications complete after 10s [id=pgxflow-backend-gnomad]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-lookup]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-admin, 20s elapsed]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-pharmcat-gnomad, 10s elapsed]
module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0]: Modifications complete after 45s [id=sbeacon-backend-performQuery]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-splitQuery]
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-generateCohortVCfs, 30s elapsed]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0]: Modifications complete after 11s [id=pgxflow-backend-pharmcat-gnomad]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-postprocessor]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-lookup, 10s elapsed]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0]: Modifications complete after 11s [id=pgxflow-backend-lookup]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0]: Modifying... [id=pgxflow-backend-dbsnp]
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Modifications complete after 36s [id=sbeacon-backend-generateCohortVCfs]
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Reading...
module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access: Read complete after 0s [id=3696512166]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Modifying... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Modifications complete after 1s [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Modifying... [id=sbeacon-backend-dataPortal]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-admin, 30s elapsed]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Still modifying... [id=sbeacon-backend-splitQuery, 10s elapsed]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0]: Still modifying... [id=pgxflow-backend-postprocessor,
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.